; domain
(define (domain satellite)
  (:requirements :typing :fluents :equality)
 (:types satellite direction instrument mode)
 (:predicates 
               (on_board ?i - instrument ?s - satellite)
	       (supports ?i - instrument ?m - mode)
	       (pointing ?s - satellite ?d - direction)
	       (power_avail ?s - satellite)
	       (power_on ?i - instrument)
	       (calibrated ?i - instrument)
	       (have_image ?d - direction ?m - mode)
	       (calibration_target ?i - instrument ?d - direction))
 
 

  (:functions (data_capacity ?s - satellite)
	      (data ?d - direction ?m - mode)
		(slew_time ?a ?b - direction)
		(data-stored)
		(fuel ?s - satellite)
		(fuel-used)
  )

  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev)
                   (not (= ?d_new ?d_prev))
		(>= (fuel ?s) (slew_time ?d_new ?d_prev))
              )
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))
		(decrease (fuel ?s) (slew_time ?d_new ?d_prev))
		(increase (fuel-used) (slew_time ?d_new ?d_prev))
           )
  )

 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
 
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s)
                 )
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))
           )
          
  )

 
  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
 
   :precondition (and (on_board ?i ?s)
                      (power_on ?i) 
                  )
   :effect (and (not (power_on ?i))
                (power_avail ?s)
           )
  )

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i)
                  )
   :effect (calibrated ?i)
  )
 

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d)
                      (power_on ?i)
			  (>= (data_capacity ?s) (data ?d ?m))
               )
   :effect (and (decrease (data_capacity ?s) (data ?d ?m)) (have_image ?d ?m)
		(increase (data-stored) (data ?d ?m)))
  )
)

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	thermograph0 - mode
	thermograph2 - mode
	image1 - mode
	GroundStation0 - direction
	Star1 - direction
	GroundStation2 - direction
	Star3 - direction
	Star4 - direction
	Star5 - direction
	Planet6 - direction
	Planet7 - direction
	Phenomenon8 - direction
)
(:init
	(supports instrument0 image1)
	(calibration_target instrument0 Star3)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star1)
	(= (data_capacity satellite0) 1000)
	(= (fuel satellite0) 191)
	(= (data Star4 thermograph0) 252)
	(= (data Star5 thermograph0) 21)
	(= (data Planet6 thermograph0) 229)
	(= (data Planet7 thermograph0) 106)
	(= (data Phenomenon8 thermograph0) 93)
	(= (data Star4 thermograph2) 89)
	(= (data Star5 thermograph2) 158)
	(= (data Planet6 thermograph2) 201)
	(= (data Planet7 thermograph2) 287)
	(= (data Phenomenon8 thermograph2) 68)
	(= (data Star4 image1) 184)
	(= (data Star5 image1) 285)
	(= (data Planet6 image1) 154)
	(= (data Planet7 image1) 207)
	(= (data Phenomenon8 image1) 135)
	(= (slew_time Star1 GroundStation0) 71.41)
	(= (slew_time GroundStation0 Star1) 71.41)
	(= (slew_time GroundStation2 GroundStation0) 49.05)
	(= (slew_time GroundStation0 GroundStation2) 49.05)
	(= (slew_time GroundStation2 Star1) 7.657)
	(= (slew_time Star1 GroundStation2) 7.657)
	(= (slew_time Star3 GroundStation0) 14.86)
	(= (slew_time GroundStation0 Star3) 14.86)
	(= (slew_time Star3 Star1) 3.603)
	(= (slew_time Star1 Star3) 3.603)
	(= (slew_time Star3 GroundStation2) 8.159)
	(= (slew_time GroundStation2 Star3) 8.159)
	(= (slew_time Star4 GroundStation0) 59.07)
	(= (slew_time GroundStation0 Star4) 59.07)
	(= (slew_time Star4 Star1) 10.57)
	(= (slew_time Star1 Star4) 10.57)
	(= (slew_time Star4 GroundStation2) 64.75)
	(= (slew_time GroundStation2 Star4) 64.75)
	(= (slew_time Star4 Star3) 27.12)
	(= (slew_time Star3 Star4) 27.12)
	(= (slew_time Star5 GroundStation0) 11.33)
	(= (slew_time GroundStation0 Star5) 11.33)
	(= (slew_time Star5 Star1) 47.92)
	(= (slew_time Star1 Star5) 47.92)
	(= (slew_time Star5 GroundStation2) 47.88)
	(= (slew_time GroundStation2 Star5) 47.88)
	(= (slew_time Star5 Star3) 24.32)
	(= (slew_time Star3 Star5) 24.32)
	(= (slew_time Star5 Star4) 49.13)
	(= (slew_time Star4 Star5) 49.13)
	(= (slew_time Planet6 GroundStation0) 10.62)
	(= (slew_time GroundStation0 Planet6) 10.62)
	(= (slew_time Planet6 Star1) 22.7)
	(= (slew_time Star1 Planet6) 22.7)
	(= (slew_time Planet6 GroundStation2) 28.47)
	(= (slew_time GroundStation2 Planet6) 28.47)
	(= (slew_time Planet6 Star3) 43.77)
	(= (slew_time Star3 Planet6) 43.77)
	(= (slew_time Planet6 Star4) 17.52)
	(= (slew_time Star4 Planet6) 17.52)
	(= (slew_time Planet6 Star5) 6.843)
	(= (slew_time Star5 Planet6) 6.843)
	(= (slew_time Planet7 GroundStation0) 49.23)
	(= (slew_time GroundStation0 Planet7) 49.23)
	(= (slew_time Planet7 Star1) 49.42)
	(= (slew_time Star1 Planet7) 49.42)
	(= (slew_time Planet7 GroundStation2) 20.99)
	(= (slew_time GroundStation2 Planet7) 20.99)
	(= (slew_time Planet7 Star3) 45.42)
	(= (slew_time Star3 Planet7) 45.42)
	(= (slew_time Planet7 Star4) 28.59)
	(= (slew_time Star4 Planet7) 28.59)
	(= (slew_time Planet7 Star5) 52.19)
	(= (slew_time Star5 Planet7) 52.19)
	(= (slew_time Planet7 Planet6) 44)
	(= (slew_time Planet6 Planet7) 44)
	(= (slew_time Phenomenon8 GroundStation0) 6.866)
	(= (slew_time GroundStation0 Phenomenon8) 6.866)
	(= (slew_time Phenomenon8 Star1) 41.91)
	(= (slew_time Star1 Phenomenon8) 41.91)
	(= (slew_time Phenomenon8 GroundStation2) 52.55)
	(= (slew_time GroundStation2 Phenomenon8) 52.55)
	(= (slew_time Phenomenon8 Star3) 13.05)
	(= (slew_time Star3 Phenomenon8) 13.05)
	(= (slew_time Phenomenon8 Star4) 42.85)
	(= (slew_time Star4 Phenomenon8) 42.85)
	(= (slew_time Phenomenon8 Star5) 73.44)
	(= (slew_time Star5 Phenomenon8) 73.44)
	(= (slew_time Phenomenon8 Planet6) 77.25)
	(= (slew_time Planet6 Phenomenon8) 77.25)
	(= (slew_time Phenomenon8 Planet7) 24)
	(= (slew_time Planet7 Phenomenon8) 24)
	(= (data-stored) 0)
	(= (fuel-used) 0)
)
(:goal (and
	(pointing satellite0 Planet6)
	(have_image Star5 image1)
))
(:metric minimize (fuel-used))

)

; plan
1. (turn_to satellite0 star5 star1)
   deleted: (pointing satellite0 star1)
   added: (pointing satellite0 star5)
   changed: (fuel satellite0) from 191 to 143.08, (fuel-used) from 0 to 47.92
   goals met: 0 of 2
2. (turn_to satellite0 planet6 star5)
   deleted: (pointing satellite0 star5)
   added: (pointing satellite0 planet6)
   changed: (fuel satellite0) from 143.08 to 136.237, (fuel-used) from 47.92 to 54.763
   goals met: 1 of 2
3. (turn_to satellite0 groundstation0 planet6)
   deleted: (pointing satellite0 planet6)
   added: (pointing satellite0 groundstation0)
   changed: (fuel satellite0) from 136.237 to 125.617, (fuel-used) from 54.763 to 65.383
   goals met: 0 of 2
4. (turn_to satellite0 star5 groundstation0)
   deleted: (pointing satellite0 groundstation0)
   added: (pointing satellite0 star5)
   changed: (fuel satellite0) from 125.617 to 114.287, (fuel-used) from 65.383 to 76.713
   goals met: 0 of 2
5. (turn_to satellite0 planet6 star5)
   deleted: (pointing satellite0 star5)
   added: (pointing satellite0 planet6)
   changed: (fuel satellite0) from 114.287 to 107.444, (fuel-used) from 76.713 to 83.556
   goals met: 1 of 2
6. (turn_to satellite0 groundstation0 planet6)
   deleted: (pointing satellite0 planet6)
   added: (pointing satellite0 groundstation0)
   changed: (fuel satellite0) from 107.444 to 96.824, (fuel-used) from 83.556 to 94.176
   goals met: 0 of 2
7. (turn_to satellite0 star5 groundstation0)
   deleted: (pointing satellite0 groundstation0)
   added: (pointing satellite0 star5)
   changed: (fuel satellite0) from 96.824 to 85.494, (fuel-used) from 94.176 to 105.506
   goals met: 0 of 2
8. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 0 of 2
9. (turn_to satellite0 planet6 star5)
   deleted: (pointing satellite0 star5)
   added: (pointing satellite0 planet6)
   changed: (fuel satellite0) from 85.494 to 78.651, (fuel-used) from 105.506 to 112.349
   goals met: 1 of 2
10. (turn_to satellite0 star3 planet6)
   deleted: (pointing satellite0 planet6)
   added: (pointing satellite0 star3)
   changed: (fuel satellite0) from 78.651 to 34.881, (fuel-used) from 112.349 to 156.119
   goals met: 0 of 2
11. (calibrate satellite0 instrument0 star3)
   added: (calibrated instrument0)
   goals met: 0 of 2
12. (turn_to satellite0 star5 star3)
   deleted: (pointing satellite0 star3)
   added: (pointing satellite0 star5)
   changed: (fuel satellite0) from 34.881 to 10.561, (fuel-used) from 156.119 to 180.439
   goals met: 0 of 2
13. (take_image satellite0 star5 instrument0 image1)
   added: (have_image star5 image1)
   changed: (data_capacity satellite0) from 1000 to 715, (data-stored) from 0 to 285
   goals met: 1 of 2
14. (turn_to satellite0 planet6 star5)
   deleted: (pointing satellite0 star5)
   added: (pointing satellite0 planet6)
   changed: (fuel satellite0) from 10.561 to 3.718, (fuel-used) from 180.439 to 187.282
   goals met: 2 of 2
